---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData
source: html/f0e68b92-5038-963b-6cb6-c987cd674a22.htm
---
# MEPNetworkSegmentData Members

Creates a default segment data object.